R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
#include "Cus_Flash.h"


/* ****************************************************** */
bool Cus_Flash_CalibrateLatency( void );
void Cus_Flash_Unlock( void );
void Cus_Flash_Lock( void );
static uint32_t Cus_Flash_GetSpinCount( uint32_t ms );
Cus_Flash_State_t Cus_Flash_WriteBuffer( uint32_t StartAddress, uint8_t *pData, uint32_t Buffer_Size );
bool Cus_Flash_VerifyBuffer(uint32_t StartAddress, uint8_t *pData, uint32_t Size);
bool Cus_Flash_IsErase( uint32_t StartAddress, uint32_t Size );


#if defined(FLASH_TYPEERASE_PAGES) && (DEVICE_STM32F1xx)
	uint32_t Cus_Flash_GetPageAddress( uint32_t page_index );
	uint32_t Cus_Flash_GetPageStart( uint32_t Address );
	bool Cus_Flash_ReadOutPage( uint32_t PageAddress, uint8_t *pOutBuffer, int32_t Size );
	Cus_Flash_State_t Cus_Flash_ErasePage(uint32_t PageAddress);
	uint16_t Cus_Flash_ErasePages( uint32_t PageStartAddress, uint16_t PageCount );
	Cus_Flash_State_t Cus_Flash_WritePage( Cus_Flash_Page_t *pPage );
	int16_t Cus_Flash_GetPageIndex( uint32_t Address );
	uint16_t Cus_Flash_GetTotalPages( void );
	int32_t Cus_Flash_GetRemainPages( uint32_t PageAddress );
	Cus_Flash_State_t Factory_GetPageControlBlock( Cus_Flash_Page_t **pPageOut );
	static void PageStructure_Reset( Cus_Flash_Page_t *pPage );
	static void PageStructure_Release( Cus_Flash_Page_t *pPage );
#endif // FLASH_TYPEERASE_PAGES


#if defined(FLASH_TYPEERASE_SECTORS) && (DEVICE_STM32F4xx)
	const Cus_Flash_Sector_t *Cus_Flash_GetSectorbyAddr( uint32_t Addr );
	const Cus_Flash_Sector_t *Cus_Flash_GetSectorbyIndex( uint8_t Index );
	uint8_t Cus_Flash_GetTotalSectors( void );
	uint8_t Cus_Flash_GetRemainSectors( uint8_t Index );
	uint32_t Cus_Flash_GetSectorSize( uint8_t Index );

	void Cus_Flash_EnableART( void );
	Cus_Flash_State_t Cus_Flash_EraseSector( const Cus_Flash_Sector_t *pSector );
	uint8_t Cus_Flash_EraseSectors( const Cus_Flash_Sector_t *pSector, uint8_t eNum );
	Cus_Flash_State_t Cus_Flash_WriteSector( const Cus_Flash_SecReq_t *pRequest );
	Cus_Flash_State_t Cus_Flash_ReadSector( const Cus_Flash_SecReq_t *pReq );

	static Cus_Flash_State_t Cus_Flash_WaitBusy( uint32_t timeout_ms );
#endif /* (FLASH_TYPEERASE_SECTORS) && (DEVICE_STM32F4xx) */


#if (CUS_FLASH_USE_MANAGER)
	Cus_Flash_State_t Cus_FlashMgr_Init( uint32_t start_addr, uint32_t end_addr );

#endif /* CUS_FLASH_USE_MANAGER */
/* ****************************************************** */


/* ****************************************************** */
#if (CUS_FLASH_USE_MANAGER)

	typedef struct 
	{
		/*  */
		uint32_t  Magic;
		uint32_t  Size;
		uint32_t  dataStartAddr;
		uint16_t  Type;
		uint16_t  validFlag;
		char Desc[16];

	} desc_t;


	typedef struct 
	{
		uint32_t msgStartAddr;
		uint32_t msgSize;
		uint16_t msgType;
		uint16_t msgFlag;
		char msgDetail[16];
		
	} FlashMgr_Record_t;

	static FlashMgr_Record_t gs_records[FLASH_MGR_MAX_RECORDS];
	static uint16_t gs_recordCount = 0;
	static uint32_t gs_lowestFreeAddr = 0;
	static uint32_t gs_StartAddr = 0;
	static uint32_t gs_EndAddr = 0;

#endif /* CUS_FLASH_USE_MANAGER */
/* ****************************************************** */


#if defined(FLASH_TYPEERASE_SECTORS) && (DEVICE_STM32F4xx)
	static const Cus_Flash_Sector_t SectorTable[] = 
	{
		#if ((DEVICE_FLASH_TOTAL_SIZE) >= (256UL * 1024UL))
		/* SECTOR 0 ~ 3. 16KB per sector. */
		{.secIndex = 0, .secStartAddr = FLASH_BASE, 		  .secSize = CUS_FLASH_SECTOR_16K},
		{.secIndex = 1, .secStartAddr = FLASH_BASE + 0x04000, .secSize = CUS_FLASH_SECTOR_16K},
		{.secIndex = 2, .secStartAddr = FLASH_BASE + 0x08000, .secSize = CUS_FLASH_SECTOR_16K},
		{.secIndex = 3, .secStartAddr = FLASH_BASE + 0x0C000, .secSize = CUS_FLASH_SECTOR_16K},

		/* SECTOR 4. 64KB. */
		{.secIndex = 4, .secStartAddr = FLASH_BASE + 0x10000, .secSize = CUS_FLASH_SECTOR_64K},

		/* SECTOR > 4 (BANK1). 128KB per Sector. */
		{.secIndex = 5, .secStartAddr = FLASH_BASE + 0x20000, .secSize = CUS_FLASH_SECTOR_128K},
		#endif /* 256KB FLASH. */

		#if ((DEVICE_FLASH_TOTAL_SIZE) >= (512UL * 1024UL))
		{.secIndex = 6, .secStartAddr = FLASH_BASE + 0x40000, .secSize = CUS_FLASH_SECTOR_128K},
		{.secIndex = 7, .secStartAddr = FLASH_BASE + 0x60000, .secSize = CUS_FLASH_SECTOR_128K},
		#endif /* 512KB FLASH. */

		#if ((DEVICE_FLASH_TOTAL_SIZE) >= (1024UL * 1024UL))
		{.secIndex = 8,  .secStartAddr = FLASH_BASE + 0x80000, .secSize = CUS_FLASH_SECTOR_128K},
		{.secIndex = 9,  .secStartAddr = FLASH_BASE + 0xA0000, .secSize = CUS_FLASH_SECTOR_128K},
		{.secIndex = 10, .secStartAddr = FLASH_BASE + 0xC0000, .secSize = CUS_FLASH_SECTOR_128K},
		{.secIndex = 11, .secStartAddr = FLASH_BASE + 0xE0000, .secSize = CUS_FLASH_SECTOR_128K},
		#endif /* 1MB FLASH. */

		#if ((DEVICE_FLASH_TOTAL_SIZE) >= (2048UL * 1024UL))
		/* BANK2. Refer BANK1. */
		{.secIndex = 12, .secStartAddr = FLASH_BASE + 0x100000, .secSize = CUS_FLASH_SECTOR_16K},  // 0x0810 0000
		{.secIndex = 13, .secStartAddr = FLASH_BASE + 0x104000, .secSize = CUS_FLASH_SECTOR_16K},  // 0x0810 4000
		{.secIndex = 14, .secStartAddr = FLASH_BASE + 0x108000, .secSize = CUS_FLASH_SECTOR_16K},  // 0x0810 8000
		{.secIndex = 15, .secStartAddr = FLASH_BASE + 0x10C000, .secSize = CUS_FLASH_SECTOR_16K},  // 0x0810 C000
		{.secIndex = 16, .secStartAddr = FLASH_BASE + 0x110000, .secSize = CUS_FLASH_SECTOR_64K},  // 0x0811 0000
		{.secIndex = 17, .secStartAddr = FLASH_BASE + 0x120000, .secSize = CUS_FLASH_SECTOR_128K}, // 0x0812 0000
		{.secIndex = 18, .secStartAddr = FLASH_BASE + 0x140000, .secSize = CUS_FLASH_SECTOR_128K}, // 0x0814 0000
		{.secIndex = 19, .secStartAddr = FLASH_BASE + 0x160000, .secSize = CUS_FLASH_SECTOR_128K}, // 0x0816 0000
		{.secIndex = 20, .secStartAddr = FLASH_BASE + 0x180000, .secSize = CUS_FLASH_SECTOR_128K}, // 0x0818 0000
		{.secIndex = 21, .secStartAddr = FLASH_BASE + 0x1A0000, .secSize = CUS_FLASH_SECTOR_128K}, // 0x081A 0000
		{.secIndex = 22, .secStartAddr = FLASH_BASE + 0x1C0000, .secSize = CUS_FLASH_SECTOR_128K}, // 0x081C 0000
		{.secIndex = 23, .secStartAddr = FLASH_BASE + 0x1E0000, .secSize = CUS_FLASH_SECTOR_128K}, // 0x081E 0000
		#endif /* 2MB FLASH. */
	};

