R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
	static const uint8_t gsc_secTotalCount = (sizeof(SectorTable) / sizeof(SectorTable[0]));

#endif /* (FLASH_TYPEERASE_SECTORS) && (DEVICE_STM32F4xx) */
/* ****************************************************** */


void 
Cus_Flash_Lock( void )
{
	uint32_t FLASH_CR_RegTemp = FLASH->CR;

	if ( (FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) != 0 )    return;   /* Has already be locked. Return. */

	uint32_t timeout = Cus_Flash_GetSpinCount(100);
	while( (FLASH->SR & FLASH_SR_BSY_Msk) && --timeout )
	{
		__nop();
	}
	if ( !timeout )
	{
		/* Timeout waiting for Flash BSY bit to clear. Bus is still busy. */
		Cus_FLASH_LockFailed_Hook();
		return;
	}

	/* FLASH_CR Lock bit set. */
	FLASH->CR |= FLASH_CR_LOCK_Msk;

	FLASH_CR_RegTemp = FLASH->CR;
	if ( !(FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) )
	{
		/* Lock failed! FLASH_CR Lock bit still reset.(write/read-back dismatch!) */
		Cus_FLASH_LockFailed_Hook();
	}
}



void 
Cus_Flash_Unlock( void )
{
	uint32_t FLASH_CR_RegTemp = FLASH->CR;

	if ( (FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) == 0 )  return;   /* Has already be unlocked. Return. */

	uint32_t timeout = Cus_Flash_GetSpinCount(100);
	while( (FLASH->SR & FLASH_SR_BSY_Msk) && --timeout )
	{
		__nop();
	}
	if ( !timeout )
	{
		/* Timeout waiting for Flash BSY bit to clear. Bus is still busy. */
		Cus_FLASH_UnlockFailed_Hook();
		return;
	}

	/* Start Flash unlock sequence by writing KEY1 to FLASH_KEYR. */ 
	FLASH->KEYR = FLASH_KEYR_KEY1;    
	__DSB();

	/* Writing the last KEY Code(KEY2) to FLASH_KEYR. */
	FLASH->KEYR = FLASH_KEYR_KEY2;    

	FLASH_CR_RegTemp = FLASH->CR;
	if ( (FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) )   
	{
		/* Unlock failed! FLASH_CR Lock bit still set. (write/read-back dismatch!) */
		Cus_FLASH_UnlockFailed_Hook();
	}
}



bool 
Cus_Flash_CalibrateLatency( void )
{
	SystemCoreClockUpdate();
	uint32_t desire_Latancy = ((FLASH->ACR) & 0x07UL);

	#if (DEVICE_STM32F1xx)
		if ( (SystemCoreClock > 0) && (SystemCoreClock <= SYSTEMCLOCK_24Mhz) )
		{
			if ( desire_Latancy == 0x00 )   return true;
			else  desire_Latancy = 0x00;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_24Mhz) && (SystemCoreClock <= SYSTEMCLOCK_48Mhz) )
		{
			if ( desire_Latancy == 0x01 )   return true;
			else desire_Latancy = 0x01;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_48Mhz) && (SystemCoreClock <= SYSTEMCLOCK_72Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 1) )  return true;
			else desire_Latancy = ((0x01UL) << 1);
		}
		else 
		{
			return false;               // 时钟错误. 不在范围内.
		}
	#endif // DEVICE_STM32F1xx

	#if (DEVICE_STM32F4xx)
		if ( (SystemCoreClock > 0) && (SystemCoreClock <= SYSTEMCLOCK_30Mhz) )
		{
			if ( desire_Latancy == 0x00 )   return true;
			else desire_Latancy = 0x00;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_30Mhz) && (SystemCoreClock <= SYSTEMCLOCK_60Mhz) )
		{
			if ( desire_Latancy == 0x01 )   return true;
			else desire_Latancy = 0x01;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_60Mhz) && (SystemCoreClock <= SYSTEMCLOCK_90Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 1) )  return true;
			else desire_Latancy = ((0x01UL) << 1);
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_90Mhz) && (SystemCoreClock <= SYSTEMCLOCK_120Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 1) | 0x01UL )  return true;
			else desire_Latancy = ((0x01UL) << 1) | 0x01UL;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_120Mhz) && (SystemCoreClock <= SYSTEMCLOCK_150Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 2) )  return true;
			else desire_Latancy = ((0x01UL) << 2);
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_150Mhz) && (SystemCoreClock <= SYSTEMCLOCK_168Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 2) | 0x01UL )  return true;
			else desire_Latancy = ((0x01UL) << 2) | 0x01UL;
		}
		else 
		{
			return false;       // 时钟错误. 不在范围内.
		}
	#endif // DEVICE_STM32F4xx

	__disable_irq();
	FLASH->ACR = (FLASH->ACR & ~0x07UL) | desire_Latancy;
	__enable_irq();

	return ((FLASH->ACR & 0x07UL) == desire_Latancy);
}



/**
 * @brief 根据系统时钟计算自旋等待的循环次数（粗略估算）
 * @param ms 超时毫秒数
 * @return 循环次数（每个循环约 5~6 个指令周期）
 */
static uint32_t 
Cus_Flash_GetSpinCount( uint32_t ms )
{
	// 估算每个循环消耗的 CPU 周期数.
	const uint32_t cycles_per_loop = 5;

	uint32_t sysclk = SystemCoreClock;

	uint32_t total_cycles = (ms * sysclk) / 1000;

	return total_cycles / cycles_per_loop;
}



Cus_Flash_State_t 
Cus_Flash_WriteBuffer( uint32_t StartAddress, uint8_t *pData, uint32_t Buffer_Size )
{
	if ( StartAddress < FLASH_BASE || StartAddress > FLASH_END_ADDR || !pData || Buffer_Size == 0 )   
		return CUS_FLASH_PARAMETER;

	if ( (StartAddress & 0x01UL) != 0 )   // 地址未半字对齐. 
	{
		return CUS_FLASH_PARAMETER;
	}

	uint8_t is_NeedExtraEdit = 0;
	if ( (Buffer_Size % 2) != 0 )  // 需要写入的数据为奇数(非2的偶数倍). 最后多一个字节需要特殊处理.   
	{
		is_NeedExtraEdit = 1;
	}

	__disable_irq();
	Cus_Flash_Unlock();

	uint32_t addr = StartAddress;
	uint8_t *pSrc = pData;
	uint32_t size = Buffer_Size;

	while( size >= 2 )
	{
		if ( HAL_FLASH_Program(TYPEPROGRAM_HALFWORD, addr, *(uint16_t *)pSrc) != HAL_OK )
		{
			__enable_irq();
			Cus_Flash_Lock();
			return CUS_FLASH_ERROR;
		}

		addr += 2;
		pSrc += 2;
		size -= 2;
	}

	if ( is_NeedExtraEdit )
	{
		// 还剩最后两字节需要处理.
		uint16_t last_16bit = 0;
		last_16bit = *pSrc; 
		if ( HAL_FLASH_Program(TYPEPROGRAM_HALFWORD, addr, last_16bit) != HAL_OK )
		{
			__enable_irq();
			Cus_Flash_Lock();
			return CUS_FLASH_ERROR;
		}
	}

	__enable_irq();
	Cus_Flash_Lock();
	return CUS_FLASH_OK;
}



bool 
Cus_Flash_VerifyBuffer( uint32_t StartAddress, uint8_t *pData, uint32_t Size )
{
	if ( StartAddress < FLASH_BASE || StartAddress > FLASH_END_ADDR || !pData || Size == 0 )  return false;

	for( uint32_t i = 0; i < Size; i++ )
	{
		if ( *((uint8_t *)StartAddress + i) != pData[i] )   
		{
			Cus_FLASH_VerifyBufferFailed_Hook(StartAddress, pData, Size);

			return false;
		}
	}

	return true;
}



bool 
Cus_Flash_IsErase( uint32_t StartAddress, uint32_t Size )
{
	if ( StartAddress < FLASH_BASE || StartAddress > FLASH_END_ADDR || Size == 0 )  return false;

