R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
		uint16_t PagesRemain = Cus_Flash_GetRemainPages(PageStartAddress);
		uint16_t PagesWaitToBeErase = PageCount;

		if ( PagesWaitToBeErase > PagesRemain )   return 0;

		int16_t CurrectPage = Cus_Flash_GetPageIndex(PageStartAddress);
		uint16_t SuccessFulEraseCount = 0;

		for( uint16_t i = 0; i < PagesWaitToBeErase; i++ )
		{
			if ( Cus_Flash_ErasePage(Cus_Flash_GetPageAddress((uint32_t)CurrectPage + i)) != CUS_FLASH_OK )
			{
				return SuccessFulEraseCount;
			}

			SuccessFulEraseCount++;
		}

		return PagesWaitToBeErase;
	}

#endif // FLASH_TYPEERASE_PAGES



#if defined(FLASH_TYPEERASE_SECTORS) && (DEVICE_STM32F4xx)

	static Cus_Flash_State_t 
	Cus_Flash_WaitBusy( uint32_t timeout_ms )
	{
		uint32_t timeout = Cus_Flash_GetSpinCount(timeout_ms);
		while( (FLASH->SR & FLASH_SR_BSY_Msk) && --timeout ) { __nop(); }

		static const uint32_t errorMask = FLASH_SR_PGAERR_Msk | FLASH_SR_PGPERR_Msk | FLASH_SR_PGSERR_Msk | FLASH_SR_WRPERR_Msk;
		if ( FLASH->SR & FLASH_SR_BSY_Msk ) return CUS_FLASH_TIMEOUT;

		if ( FLASH->SR & errorMask ) 
		{
			/* Clear error flag and return. */
			FLASH->SR |= errorMask;
			return CUS_FLASH_ERROR;
		}

		return CUS_FLASH_OK;
	}



	const Cus_Flash_Sector_t *
	Cus_Flash_GetSectorbyAddr( uint32_t Addr )
	{
		if ( (Addr < FLASH_BASE) || (Addr >= FLASH_END_ADDR) )	return NULL;

		for( uint8_t index = 0; index < gsc_secTotalCount; index++ )
		{
			uint32_t end_addr = SectorTable[index].secStartAddr + SectorTable[index].secSize;
			uint32_t start_addr = SectorTable[index].secStartAddr;
			if ( (Addr >= start_addr) && (Addr < end_addr) )
			{
				/* Find relevant sector. */
				return (const Cus_Flash_Sector_t *)&SectorTable[index];
			}
		}

		return NULL;
	}



	const Cus_Flash_Sector_t *
	Cus_Flash_GetSectorbyIndex( uint8_t Index )
	{
		if ( Index >= gsc_secTotalCount )	return NULL;

		return (const Cus_Flash_Sector_t *)&SectorTable[Index];
	}



	uint8_t 
	Cus_Flash_GetTotalSectors( void )
	{
		return gsc_secTotalCount;
	}



	uint32_t 
	Cus_Flash_GetSectorSize( uint8_t Index )
	{
		if ( Index >= gsc_secTotalCount )	return 0;

		return SectorTable[Index].secSize;
	}



	uint8_t 
	Cus_Flash_GetRemainSectors( uint8_t Index )
	{
		if ( Index >= gsc_secTotalCount )	return 0;

		return ((gsc_secTotalCount - 1) - Index);
	}



	void 
	Cus_Flash_EnableART( void )
	{
		uint32_t acrReg = FLASH->ACR;
		uint32_t currentHCLK = HAL_RCC_GetHCLKFreq();
		if ( (currentHCLK > SYSTEMCLOCK_60Mhz) && ((acrReg & FLASH_ACR_LATENCY_Msk) < 2) )
		{
			/* Wrong ACR LATENCY Config.Refuse to enable ART. */
			Cus_FLASH_ARTEnableFailed_Hook(acrReg);
			return;
		}

		if ( (acrReg & FLASH_ACR_PRFTEN_Msk) && (acrReg & FLASH_ACR_ICEN_Msk) && (acrReg & FLASH_ACR_DCEN_Msk) )
		{
			/* ART Accelerator has been Enabled. */
			return;
		}

		/* Enable Flash prefetch buffer and instruction cache (PRFTEN & ICEN & DCEN). */
		FLASH->ACR |= (FLASH_ACR_PRFTEN_Msk | FLASH_ACR_ICEN_Msk | FLASH_ACR_DCEN_Msk);
		__DSB();

		/* Check if the config has been written. */
		if ( !(FLASH->ACR & FLASH_ACR_PRFTEN_Msk) || !(FLASH->ACR & FLASH_ACR_ICEN_Msk) || !(FLASH->ACR & FLASH_ACR_DCEN_Msk) )
		{
			/* Something error happend? inform the upper layer. */
			Cus_FLASH_ARTEnableFailed_Hook(FLASH->ACR);
			return;
		}

		/* Success. Normal back. */
	}



	Cus_Flash_State_t 
	Cus_Flash_EraseSector( const Cus_Flash_Sector_t *pSector )
	{
		if ( !pSector )		return CUS_FLASH_PARAMETER;		/* Invalid parameter. */

		uint32_t timeout = Cus_Flash_GetSpinCount(300);
		while( (FLASH->SR & FLASH_SR_BSY_Msk) && --timeout )
		{
			__nop();
		}
		if ( !timeout )
		{
			/* Timeout waiting for Flash BSY bit to clear. Bus is still busy. */
			Cus_FLASH_EraseSectorFailed_Hook(pSector);
			return CUS_FLASH_BUSY;
		}

		Cus_Flash_Unlock();

		/* Set FLASH_CR SER bit. */
		FLASH->CR |= FLASH_CR_SER_Msk;

		uint32_t snbVal = 0;
		switch (gsc_secTotalCount)
		{
			/* Directly write secIndex to SNB. For 12-sector devices, indices 0~11 map 1:1 to hardware encoding. */ 
			case 6:
			case 8:
			case 12:	snbVal = pSector->secIndex;	break;

			/* Physical sectors 12~23 map to SNB values 16~27 (offset +4), because SNB 12~15 are reserved. */ 
			case 24:	snbVal = (pSector->secIndex >= 12) ? (pSector->secIndex + 4) : (pSector->secIndex);	  break;

			/* Unexpected sector index. Notify upper layer via hook and return. */
			default:	goto ERROR;
		}

		/* Write SectorIndex which waiting for erasing to FLASH_CR SNB. */
		FLASH->CR |= (snbVal << FLASH_CR_SNB_Pos);

		/* Set FLASH_CR STRT bit. */
		FLASH->CR |= FLASH_CR_STRT_Msk;

		/* Wait for BSY to clear (erase finished). */
		timeout = Cus_Flash_GetSpinCount(3000);		/* about 3s. */
		while( (FLASH->SR & FLASH_SR_BSY_Msk) && --timeout )
		{
			__nop();
		}
		if ( !timeout )
		{
			/* Error! BSY clear timeout. */
			goto ERROR;
		}

		/* Normal back. */
		Cus_Flash_Lock();
		return CUS_FLASH_OK;

	ERROR:
		Cus_Flash_Lock();
		Cus_FLASH_EraseSectorFailed_Hook(pSector);
		return CUS_FLASH_ERROR;
	}



	uint8_t 
	Cus_Flash_EraseSectors( const Cus_Flash_Sector_t *pSector, uint8_t eNum )
	{
		if ( !pSector || !eNum )		return 0;

		uint8_t Remain = Cus_Flash_GetRemainSectors(pSector->secIndex);
		if ( eNum > (Remain + 1) )
		{
			/* Requested erase count exceeds remaining sectors. Return. */
			return 0;
		}

		/* Erasing multiple sectors. */
		Cus_Flash_State_t hReturn = CUS_FLASH_OK;
		uint8_t offset = 0;
		uint8_t waitErased = eNum;
		while( (hReturn == CUS_FLASH_OK) && waitErased-- )
		{
			const Cus_Flash_Sector_t *currentSec = Cus_Flash_GetSectorbyIndex(pSector->secIndex + offset++);
			hReturn = Cus_Flash_EraseSector(currentSec);
		}
		if ( (waitErased != 0) && (hReturn != CUS_FLASH_OK) )
		{
			/* Something error happend while erasing.Return with Successfully erased count. */
			return (eNum - waitErased);
		}

		/* Successfully erased all sectors. Normal back. */
		return eNum;
	}



	Cus_Flash_State_t 
	Cus_Flash_WriteSector( const Cus_Flash_SecReq_t *pRequest )
	{
		if ( !pRequest || !pRequest->pBuffer || !pRequest->bufSize || !pRequest->pSector )	return CUS_FLASH_PARAMETER;

